
## Plan Result

[CI link](https://github.com/l-1cm-l/gha_playground/actions/runs/13828044610)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_storage_bucket.test_bucket_202503131452
  * google_storage_bucket.test_bucket_202503131455


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_storage_bucket.test_bucket_202503131452 will be created
  + resource "google_storage_bucket" "test_bucket_202503131452" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "test-bucket-202503131452"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.test_bucket_202503131455 will be created
  + resource "google_storage_bucket" "test_bucket_202503131455" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "test-bucket-202503131455"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"aws-googlecloud-terraform-plan","PRNumber":57,"Program":"tfcmt","SHA1":"8cdb0e0766118d4134ff1619d0a2e99d16f48ed4","Vars":{},"WorkflowName":"terraform-plan"} -->